Repository: minios-linux/minios-installer
Catalog: po/*.po
Languages: es, it, pt, ru

source: <b>GRUB</b> + Modern bootloader with advanced features. + Better compatibility with complex configurations. + Support for advanced boot scenarios. - May not work with Ventoy (requires GRUB2 mode). - May have issues with older systems (Debian 10, for example). <b>SYSLINUX</b> + Lightweight and fast bootloader. + Better compatibility with Ventoy and older systems. + Simple and reliable for basic setups. - Limited advanced features.
es: <b>GRUB</b> + Gestor de arranque moderno con funciones avanzadas. + Mejor compatibilidad con configuraciones complejas. + Soporte para escenarios de arranque avanzados. - Puede que no funcione con Ventoy (requiere modo GRUB2). - Puede tener problemas con sistemas antiguos (Debian 10, por ejemplo). <b>SYSLINUX</b> + Gestor de arranque ligero y rápido. + Mejor compatibilidad con Ventoy y sistemas antiguos. + Simple y fiable para configuraciones básicas. - Funciones avanzadas limitadas.
it: <b>GRUB</b> + Bootloader moderno con funzionalità avanzate. + Migliore compatibilità con configurazioni complesse. + Supporto per scenari di avvio avanzati. - Potrebbe non funzionare con Ventoy (richiede la modalità GRUB2). - Potrebbe avere problemi con i sistemi più vecchi (Debian 10, ad esempio). <b>SYSLINUX</b> + Bootloader leggero e veloce. + Migliore compatibilità con Ventoy e sistemi meno recenti. + Semplice e affidabile per le configurazioni di base. - Funzionalità avanzate limitate.
pt: <b>GRUB</b> + Bootloader moderno com recursos avançados. + Melhor compatibilidade com configurações complexas. + Suporte para cenários de inicialização avançados. - Pode não funcionar com o Ventoy (requer o modo GRUB2). - Pode ter problemas com sistemas mais antigos (Debian 10, por exemplo). <b>SYSLINUX</b> + Bootloader leve e rápido. + Melhor compatibilidade com Ventoy e sistemas mais antigos. + Simples e confiável para configurações básicas. - Recursos avançados limitados.
ru: <b>GRUB</b> + Современный загрузчик с расширенными возможностями. + Лучшая совместимость со сложными конфигурациями. + Поддержка расширенных сценариев загрузки. - Может не работать с Ventoy (требуется режим GRUB2). - Возможны проблемы со старыми системами (например, Debian 10). <b>SYSLINUX</b> + Легковесный и быстрый загрузчик. + Лучшая совместимость с Ventoy и старыми системами. + Простой и надежный для базовых установок. - Ограниченные расширенные возможности.

source: This selection only affects BIOS boot. EFI systems always use GRUB.
es: Esta selección solo afecta el arranque BIOS. Los sistemas EFI siempre utilizan GRUB.
ru: <small><i>Этот выбор влияет только на загрузку BIOS. Системы EFI всегда используют GRUB.</i></small>

source: WARNING: This action is irreversible!
es: ¡ADVERTENCIA: esta acción es irreversible!
it: ATTENZIONE: questa azione è irreversibile!
pt: ATENÇÃO: esta ação é irreversível!
ru: ВНИМАНИЕ: это действие необратимо!

source: Device information:
es: Información del dispositivo:
it: Informazioni sul dispositivo:
pt: Informações do dispositivo:
ru: Информация об устройстве:

source: What will be erased:
es: Lo que se borrará:
it: Cosa sarà cancellato:
pt: O que será apagado:
ru: Что будет стерто:

source: selected device
es: dispositivo seleccionado
it: dispositivo selezionato
pt: dispositivo selecionado
ru: выбранное устройство

source: Files, documents, and applications
es: Archivos, documentos y aplicaciones
it: File, documenti e applicazioni
pt: Arquivos, documentos e aplicativos
ru: Файлы, документы и приложения

source: Operating systems
es: Sistemas operativos
it: Sistemi operativi
pt: Sistemas operacionais
ru: Операционные системы

source: Personal data and settings
es: Datos personales y configuraciones
it: Dati personali e impostazioni
pt: Dados pessoais e configurações
ru: Личные данные и настройки

source: All partitions and file systems
es: Todas las particiones y sistemas de archivos
it: Tutte le partizioni e i file system
pt: Todas as partições e sistemas de arquivos
ru: Все разделы и файловые системы

source: Go Back
es: Volver
it: Indietro
pt: Voltar
ru: Назад

source: Continue
es: Continuar
it: Continua
pt: Continuar
ru: Продолжить

source: Preparing to install...
es: Preparando la instalación...
it: Preparazione all'installazione...
pt: Preparando para instalar...
ru: Подготовка к установке...

source: Show Log
es: Mostrar registro
it: Mostra log
pt: Mostrar log
ru: Показать журнал

source: Cancel
es: Cancelar
it: Annulla
pt: Cancelar
ru: Отмена

source: Hide Log
es: Ocultar registro
it: Nascondi log
pt: Ocultar log
ru: Скрыть журнал

source: Installation canceled.
es: Instalación cancelada.
it: Installazione annullata.
pt: Instalação cancelada.
ru: Установка отменена.

source: Restart Installation
es: Reiniciar instalación
it: Riavvia installazione
pt: Reiniciar instalação
ru: Перезапустить установку

source: Unmounting disk...
es: Desmontando disco...
it: Smontaggio disco...
pt: Desmontando disco...
ru: Размонтирование диска...

source: Erasing disk...
es: Borrando disco...
it: Cancellazione disco...
pt: Apagando disco...
ru: Стирание диска...

source: Partitioning disk...
es: Particionando disco...
it: Partizionamento disco...
pt: Particionando disco...
ru: Разметка диска...

source: Formatting partitions...
es: Formateando particiones...
it: Formattazione partizioni...
pt: Formatando partições...
ru: Форматирование разделов...

source: Mounting partition...
es: Montando partición...
it: Montaggio partizione...
pt: Montando partição...
ru: Монтирование раздела...

source: Error at step:
es: Error en el paso:
it: Errore al passaggio:
pt: Erro na etapa:
ru: Ошибка на шаге:

source: Installation failed:
es: La instalación falló:
it: Installazione non riuscita:
pt: Falha na instalação:
ru: Установка не удалась:

source: Mounting EFI partition...
es: Montando partición EFI...
it: Montaggio partizione EFI...
pt: Montando partição EFI...
ru: Монтирование раздела EFI...

source: Error mounting EFI partition:
es: Error al montar la partición EFI:
it: Errore durante il montaggio della partizione EFI:
pt: Erro ao montar a partição EFI:
ru: Ошибка при монтировании раздела EFI:

source: Copying files...
es: Copiando archivos...
it: Copia dei file...
pt: Copiando arquivos...
ru: Копирование файлов...

source: Cannot find MiniOS image.
es: No se puede encontrar la imagen de MiniOS.
it: Impossibile trovare l'immagine MiniOS.
pt: Não foi possível encontrar a imagem do MiniOS.
ru: Не удалось найти образ MiniOS.

source: Copying EFI files to root...
es: Copiando archivos EFI a la raíz...
it: Copia dei file EFI nella root...
pt: Copiando arquivos EFI para a raiz...
ru: Копирование EFI-файлов в корень...

source: Copying EFI files to ESP...
es: Copiando archivos EFI a ESP...
it: Copia dei file EFI su ESP...
pt: Copiando arquivos EFI para ESP...
ru: Копирование EFI-файлов на ESP...

source: Error during file copy:
es: Error durante la copia de archivos:
it: Errore durante la copia dei file:
pt: Erro ao copiar arquivos:
ru: Ошибка при копировании файлов:

source: Setting up bootloader...
es: Configurando el gestor de arranque...
it: Configurazione del bootloader...
pt: Configurando o bootloader...
ru: Настройка загрузчика...

source: Error setting up bootloader:
es: Error al configurar el gestor de arranque:
it: Errore durante la configurazione del bootloader:
pt: Erro ao configurar o bootloader:
ru: Ошибка при настройке загрузчика:

source: Error during unmount:
es: Error al desmontar:
it: Errore durante lo smontaggio:
pt: Erro ao desmontar:
ru: Ошибка при размонтировании:

source: Installation complete!
es: ¡Instalación completa!
it: Installazione completata!
pt: Instalação concluída!
ru: Установка завершена!

source: Installation Error
es: Error de instalación
it: Errore di installazione
pt: Erro de instalação
ru: Ошибка установки

source: Config file not found
es: Archivo de configuración no encontrado
it: File di configurazione non trovato
pt: Arquivo de configuração não encontrado
ru: Файл конфигурации не найден

source: Standard config file not found at {}.
ru: Стандартный файл конфигурации не найден в {}.

source: Launch Error
es: Error de inicio
it: Errore di avvio
pt: Erro ao iniciar
ru: Ошибка запуска

source: Root Privileges Required
es: Se requieren privilegios de root
it: Privilegi di root richiesti
pt: Privilégios de root necessários
ru: Требуются права администратора

source: This installer must be run as root.
es: Este instalador debe ejecutarse como root.
it: Questo programma di installazione deve essere eseguito come root.
pt: Este instalador deve ser executado como root.
ru: Этот установщик должен быть запущен от имени root.

source: Failed to retrieve disk list.
es: No se pudo obtener la lista de discos.
it: Impossibile recuperare l'elenco dei dischi.
pt: Falha ao obter a lista de discos.
ru: Не удалось получить список дисков.

source: Failed to detect live media device
es: No se pudo detectar el dispositivo de medios en vivo
it: Impossibile rilevare il dispositivo media in diretta
pt: Falha ao detectar dispositivo de mídia ao vivo
ru: Не удалось обнаружить устройство загрузочного носителя

source: Failed to detect root disk
es: No se pudo detectar el disco raíz
it: Impossibile rilevare il disco di root
pt: Falha ao detectar disco raiz
ru: Не удалось обнаружить корневой диск

source: Failed to get disk size.
es: No se pudo obtener el tamaño del disco.
it: Impossibile ottenere la dimensione del disco.
pt: Falha ao obter o tamanho do disco.
ru: Не удалось определить размер диска.

source: Could not parse disk size.
es: No se pudo analizar el tamaño del disco.
it: Impossibile interpretare la dimensione del disco.
pt: Não foi possível interpretar o tamanho do disco.
ru: Не удалось распознать размер диска.

source: Failed to set GPT label on
es: No se pudo establecer la etiqueta GPT en
it: Impossibile impostare l'etichetta GPT su
pt: Falha ao definir o rótulo GPT em
ru: Не удалось установить метку GPT на

source: Failed to create primary partition on
es: No se pudo crear la partición primaria en
it: Impossibile creare la partizione primaria su
pt: Falha ao criar partição primária em
ru: Не удалось создать основной раздел на

source: Failed to create EFI partition on
es: No se pudo crear la partición EFI en
it: Impossibile creare la partizione EFI su
pt: Falha ao criar partição EFI em
ru: Не удалось создать раздел EFI на

source: Failed to set boot flag.
es: No se pudo establecer el indicador de arranque.
it: Impossibile impostare il flag di avvio.
pt: Falha ao definir o flag de boot.
ru: Не удалось установить загрузочный флаг.

source: Failed to set MSDOS label on
es: No se pudo establecer la etiqueta MSDOS en
it: Impossibile impostare l'etichetta MSDOS su
pt: Falha ao definir o rótulo MSDOS em
ru: Не удалось установить метку MSDOS на

source: Failed to create second partition on
es: No se pudo crear la segunda partición en
it: Impossibile creare la seconda partizione su
pt: Falha ao criar a segunda partição em
ru: Не удалось создать второй раздел на

source: Failed to erase
es: No se pudo borrar
it: Impossibile cancellare
pt: Falha ao apagar
ru: Не удалось стереть

source: Copying MiniOS files:
es: Copiando archivos de MiniOS:
it: Copia dei file MiniOS:
pt: Copiando arquivos do MiniOS:
ru: Копирование файлов MiniOS:

source: Copied file:
es: Archivo copiado:
it: File copiato:
pt: Arquivo copiado:
ru: Скопирован файл:

source: Created directory:
es: Directorio creado:
it: Cartella creata:
pt: Diretório criado:
ru: Создан каталог:

source: Copied EFI file:
es: Archivo EFI copiado:
it: File EFI copiato:
pt: Arquivo EFI copiado:
ru: Скопирован EFI-файл:

source: Warning: No translations found for {lang}, using English fallback
es: Advertencia: No se encontraron traducciones para {lang}, usando inglés como respaldo
it: Avviso: Nessuna traduzione trovata per {lang}, uso l'inglese come fallback
pt: Aviso: Nenhuma tradução encontrada para {lang}, usando inglês como alternativa
ru: Предупреждение: переводы для {lang} не найдены, используется английский вариант

source: Error: grub.template.cfg template not found
es: Error: plantilla grub.template.cfg no encontrada
it: Errore: modello grub.template.cfg non trovato
pt: Erro: modelo grub.template.cfg não encontrado
ru: Ошибка: шаблон grub.template.cfg не найден

source: Using localized theme: {theme}
es: Usando tema localizado: {theme}
it: Uso tema localizzato: {theme}
pt: Usando tema localizado: {theme}
ru: Используется локализованная тема: {theme}

source: Localized theme not found for {lang}, using default
es: Tema localizado no encontrado para {lang}, usando el predeterminado
it: Tema localizzato non trovato per {lang}, uso quello predefinito
pt: Tema localizado não encontrado para {lang}, usando o padrão
ru: Локализованная тема для {lang} не найдена, используется тема по умолчанию

source: Generated localized GRUB config for {lang}
es: Configuración GRUB localizada generada para {lang}
it: Configurazione GRUB localizzata generata per {lang}
pt: Configuração GRUB localizada gerada para {lang}
ru: Создан локализованный конфиг GRUB для языка: {lang}

source: Error generating localized GRUB config: {error}
es: Error generando configuración GRUB localizada: {error}
it: Errore durante la generazione della configurazione GRUB localizzata: {error}
pt: Erro ao gerar configuração GRUB localizada: {error}
ru: Ошибка при создании локализованного конфига GRUB: {error}

source: GRUB directory not found, skipping GRUB boot menu configuration
es: Directorio GRUB no encontrado, omitiendo configuración del menú de arranque GRUB
it: Directory GRUB non trovata, salto configurazione menu di avvio GRUB
pt: Diretório GRUB não encontrado, ignorando configuração do menu de inicialização GRUB
ru: Каталог GRUB не найден, пропускаем настройку загрузочного меню GRUB

source: multilingual menu
es: menú multiidioma
it: menu multilingue
pt: menu multilíngue
ru: многоязычное меню

source: Applied {config} GRUB boot menu from {source}
es: Aplicado {config} menú de arranque GRUB desde {source}
it: Applicato menu di avvio GRUB {config} da {source}
pt: Aplicado menu de inicialização GRUB {config} de {source}
ru: Применено {config} загрузочное меню GRUB из {source}

source: Warning: {config} configuration file not found, keeping original grub.cfg
es: Advertencia: archivo de configuración {config} no encontrado, manteniendo grub.cfg original
it: Avviso: file di configurazione {config} non trovato, mantengo grub.cfg originale
pt: Aviso: arquivo de configuração {config} não encontrado, mantendo grub.cfg original
ru: Предупреждение: файл конфигурации {config} не найден, оставляем оригинальный grub.cfg

source: Generating localized GRUB menu for language: {lang}
es: Generando menú GRUB localizado para el idioma: {lang}
it: Generazione del menu GRUB localizzato per la lingua: {lang}
pt: Gerando menu GRUB localizado para o idioma: {lang}
ru: Генерация локализованного меню GRUB для языка: {lang}

source: Applied {lang} GRUB boot menu
es: Aplicado menú de arranque GRUB en {lang}
it: Applicato menu di avvio GRUB in {lang}
pt: Menu de inicialização GRUB aplicado para o idioma {lang}
ru: Применено загрузочное меню GRUB для языка: {lang}

source: Failed to generate {lang} config, falling back to template
es: No se pudo generar la configuración para {lang}, usando plantilla
it: Impossibile generare la configurazione {lang}, si torna al modello
ru: Не удалось создать конфигурацию для языка {lang}, используется шаблон

source: Applied template GRUB boot menu as fallback
es: Aplicado menú de arranque GRUB de plantilla como respaldo
it: Menu di avvio GRUB del modello applicato come fallback
ru: Применено загрузочное меню GRUB из шаблона в качестве резервного варианта

source: Warning: No fallback configuration available, keeping original grub.cfg
es: Advertencia: no hay configuración de respaldo disponible, manteniendo grub.cfg original
it: Avviso: nessuna configurazione di fallback disponibile, mantengo grub.cfg originale
pt: Aviso: Nenhuma configuração alternativa disponível, mantendo grub.cfg original
ru: Предупреждение: резервная конфигурация недоступна, сохраняется оригинальный grub.cfg

source: NVMe SSD
es: SSD NVMe
it: SSD NVMe
pt: SSD NVMe
