Repository: minios-linux/minios-installer
Catalog: po/*.po
Languages: es, it, pt, ru

source: Installing SYSLINUX bootloader...
ru: Установка загрузчика SYSLINUX...

source: Remounted boot directory with exec.
es: Directorio de arranque remontado con ejecución.
it: Directory di avvio rimontata con esecuzione.
pt: Diretório de inicialização remontado com execução.
ru: Каталог загрузки перемонтирован с выполнением.

source: Failed to remount boot directory; proceeding.
es: No se pudo remontar el directorio de arranque; continuando.
it: Impossibile rimontare la directory di boot; si procede.
pt: Falha ao remontar o diretório de arranque; prosseguindo.
ru: Не удалось перемонтировать загрузочный каталог; продолжение.

source: Made extlinux executable.
es: extlinux hecho ejecutable.
it: Reso extlinux eseguibile.
pt: Tornado extlinux executável.
ru: Сделан extlinux исполняемым.

source: Copied syslinux to fallback: {fallback_name}
ru: Syslinux скопирован в резервный: {fallback_name}

source: syslinux install failed (code {code}), trying fallback in /tmp...
ru: Установка syslinux не удалась (код {code}), попытка резервного в /tmp...

source: Error installing boot loader (fallback code {code}).
es: Error al instalar el cargador de arranque (código de fallback {code}).
it: Errore durante l'installazione del boot loader (codice fallback {code}).
pt: Erro ao instalar o carregador de inicialização (código de fallback {code}).
ru: Ошибка установки загрузчика (код резервного {code}).

source: Boot loader installation succeeded via fallback.
es: La instalación del gestor de arranque tuvo éxito mediante respaldo.
it: Installazione del boot loader riuscita tramite fallback.
pt: Instalação do gestor de arranque bem-sucedida através do recurso.
ru: Установка загрузчика успешно завершена с использованием резервного метода.

source: Ran syslinux installer (code {code}).
ru: Запущен установщик syslinux (код {code}).

source: Removed fallback binary: syslinux.exe.
ru: Резервный бинарный файл удален: syslinux.exe.

source: SYSLINUX bootloader installation completed
ru: Установка загрузчика SYSLINUX завершена

source: Failed to format
es: No se pudo formatear
it: Impossibile formattare
pt: Falha ao formatar
ru: Не удалось отформатировать

source: Failed to format EFI
es: No se pudo formatear EFI
it: Impossibile formattare EFI
pt: Falha ao formatar EFI
ru: Не удалось отформатировать EFI

source: GRUB - Modern bootloader with advanced features
es: GRUB - Gestor de arranque moderno con funciones avanzadas
ru: GRUB - Современный загрузчик с расширенными возможностями

source: SYSLINUX - Lightweight bootloader for legacy systems
es: SYSLINUX - Gestor de arranque ligero para sistemas antiguos
ru: SYSLINUX - Легкий загрузчик для устаревших систем

source: Installation canceled by user.
es: Instalación cancelada por el usuario.
it: Installazione annullata dall'utente.
pt: Instalação cancelada pelo usuário.
ru: Установка отменена пользователем.

source: Entering bootloader directory: {boot_dir}
es: Entrando en el directorio del gestor de arranque: {boot_dir}
it: Entrata nella cartella del bootloader: {boot_dir}
pt: Entrando no diretório do bootloader: {boot_dir}
ru: Переход в каталог загрузчика: {boot_dir}

source: Using user-selected bootloader: {type}
ru: Используется выбранный пользователем загрузчик: {type}

source: Auto-detected bootloader type: {type}
ru: Автоматически определен тип загрузчика: {type}

source: Selected bootloader not available, falling back to: {type}
ru: Выбранный загрузчик недоступен, используется резервный: {type}

source: Installing GRUB bootloader...
es: Instalando gestor de arranque GRUB...
it: Installazione bootloader GRUB...
pt: Instalando bootloader GRUB...
ru: Установка загрузчика GRUB...

source: Using portable grub-bios-setup from image
es: Usando grub-bios-setup portátil desde la imagen
it: Uso di grub-bios-setup portatile dall'immagine
pt: Usando grub-bios-setup portátil da imagem
ru: Использование портативного grub-bios-setup из образа

source: GRUB installed successfully using grub-bios-setup
es: GRUB instalado exitosamente usando grub-bios-setup
it: GRUB installato con successo usando grub-bios-setup
pt: GRUB instalado com sucesso usando grub-bios-setup
ru: GRUB успешно установлен с помощью grub-bios-setup

source: grub-bios-setup failed (code {code}), trying manual installation...
es: grub-bios-setup falló (código {code}), intentando instalación manual...
it: grub-bios-setup fallito (codice {code}), tentativo di installazione manuale...
pt: grub-bios-setup falhou (código {code}), tentando instalação manual...Instalação do extlinux falhou (código {code}), tentando fallback em /tmp...
ru: grub-bios-setup не удался (код {code}), пытаюсь ручную установку...

source: grub-bios-setup failed with exception: {error}
es: grub-bios-setup falló con excepción: {error}
it: grub-bios-setup fallito con eccezione: {error}
pt: grub-bios-setup falhou com exceção: {error}
ru: grub-bios-setup завершился с исключением: {error}

source: grub-bios-setup not found in image, using manual installation...
es: grub-bios-setup no encontrado en la imagen, usando instalación manual...
it: grub-bios-setup non trovato nell'immagine, uso installazione manuale...
pt: grub-bios-setup não encontrado na imagem, usando instalação manual...
ru: grub-bios-setup не найден в образе, использую ручную установку...

source: GRUB bootloader installation completed
es: Instalación del gestor de arranque GRUB completada
it: Installazione bootloader GRUB completata
pt: Instalação do bootloader GRUB concluída
ru: Установка загрузчика GRUB завершена

source: Performing manual GRUB installation...
es: Realizando instalación manual de GRUB...
it: Esecuzione installazione manuale di GRUB...
pt: Executando instalação manual do GRUB...
ru: Выполнение ручной установки GRUB...

source: Device: {device}, Primary partition: {primary}
es: Dispositivo: {device}, Partición primaria: {primary}
it: Dispositivo: {device}, Partizione primaria: {primary}
pt: Dispositivo: {device}, Partição primária: {primary}
ru: Устройство: {device}, Основной раздел: {primary}

source: GRUB directory: {grub_dir}
es: Directorio GRUB: {grub_dir}
it: Directory GRUB: {grub_dir}
pt: Diretório GRUB: {grub_dir}
ru: Каталог GRUB: {grub_dir}

source: Installing boot.img (size: {size} bytes) to MBR
es: Instalando boot.img (tamaño: {size} bytes) en MBR
it: Installazione boot.img (dimensione: {size} byte) nel MBR
pt: Instalando boot.img (tamanho: {size} bytes) no MBR
ru: Установка boot.img (размер: {size} байт) в MBR

source: Installed GRUB stage 1 (boot.img) to MBR
es: Instalado GRUB etapa 1 (boot.img) en MBR
it: Installato GRUB fase 1 (boot.img) nel MBR
pt: Instalado GRUB estágio 1 (boot.img) no MBR
ru: Установлен GRUB этап 1 (boot.img) в MBR

source: Installed GRUB boot_hybrid.img to MBR as fallback
es: Instalado GRUB boot_hybrid.img en MBR como respaldo
it: Installato GRUB boot_hybrid.img nel MBR come fallback
pt: Instalado GRUB boot_hybrid.img no MBR como reserva
ru: Установлен GRUB boot_hybrid.img в MBR как резервный

source: No GRUB boot images found in {dir}
es: No se encontraron imágenes de arranque GRUB en {dir}
it: Nessuna immagine di boot GRUB trovata in {dir}
pt: Nenhuma imagem de boot GRUB encontrada em {dir}
ru: Загрузочные образы GRUB не найдены в {dir}

source: Installing diskboot.img (size: {size} bytes) to partition
es: Instalando diskboot.img (tamaño: {size} bytes) en la partición
it: Installazione diskboot.img (dimensione: {size} byte) sulla partizione
pt: Instalando diskboot.img (tamanho: {size} bytes) na partição
ru: Установка diskboot.img (размер: {size} байт) на раздел

source: Installed GRUB stage 1.5 (diskboot.img) to partition
es: Instalado GRUB etapa 1.5 (diskboot.img) en la partición
it: Installato GRUB fase 1.5 (diskboot.img) sulla partizione
pt: Instalado GRUB estágio 1.5 (diskboot.img) na partição
ru: Установлен GRUB этап 1.5 (diskboot.img) на раздел

source: diskboot.img not found, skipping partition boot sector installation
es: diskboot.img no encontrado, omitiendo instalación del sector de arranque de la partición
it: diskboot.img non trovato, salto installazione settore di boot partizione
pt: diskboot.img não encontrado, pulando instalação do setor de boot da partição
ru: diskboot.img не найден, пропускаю установку загрузочного сектора раздела

source: Installed core.img to boot gap
es: Instalado core.img en el espacio de arranque
it: Installato core.img nello spazio di boot
pt: Instalado core.img no espaço de boot
ru: Установлен core.img в загрузочный зазор

source: Warning: Failed to install core.img: {error}
es: Advertencia: Fallo al instalar core.img: {error}
it: Avviso: Fallita installazione di core.img: {error}
pt: Aviso: Falhou ao instalar core.img: {error}
ru: Предупреждение: Не удалось установить core.img: {error}

source: Warning: core.img not found in image - GRUB may not boot properly
es: Advertencia: core.img no encontrado en la imagen - GRUB podría no arrancar correctamente
it: Avviso: core.img non trovato nell'immagine - GRUB potrebbe non avviarsi correttamente
pt: Aviso: core.img não encontrado na imagem - GRUB pode não inicializar corretamente
ru: Предупреждение: core.img не найден в образе - GRUB может работать неправильно

source: Installing EXTLINUX bootloader...
es: Instalando gestor de arranque EXTLINUX...
it: Installazione bootloader EXTLINUX...
pt: Instalando bootloader EXTLINUX...
ru: Установка загрузчика EXTLINUX...

source: Copied extlinux to fallback: {fallback_name}
es: Extlinux copiado al fallback: {fallback_name}
it: Extlinux copiato nel fallback: {fallback_name}
pt: Extlinux copiado para fallback: {fallback_name}
ru: Extlinux скопирован в резервный: {fallback_name}

source: extlinux install failed (code {code}), trying fallback in /tmp...
es: Instalación de extlinux fallida (código {code}), intentando fallback en /tmp...
it: Installazione di extlinux fallita (codice {code}), tentativo di fallback in /tmp...
pt: Instalação do extlinux falhou (código {code}), tentando fallback em /tmp...
ru: Установка extlinux не удалась (код {code}), попытка резервного в /tmp...

source: Ran extlinux installer (code {code}).
es: Instalador de extlinux ejecutado (código {code}).
it: Eseguito l'installer extlinux (codice {code}).
pt: Executado o instalador extlinux (código {code}).
ru: Запущен установщик extlinux (код {code}).

source: Removed fallback binary: extlinux.exe.
es: Binario de fallback eliminado: extlinux.exe.
it: Binario di fallback rimosso: extlinux.exe.
pt: Binário de fallback removido: extlinux.exe.
ru: Резервный бинарный файл удален: extlinux.exe.

source: EXTLINUX bootloader installation completed
es: Instalación del gestor de arranque EXTLINUX completada
it: Installazione bootloader EXTLINUX completata
pt: Instalação do bootloader EXTLINUX concluída
ru: Установка загрузчика EXTLINUX завершена

source: MBR signature OK (0x55AA)
es: Firma MBR correcta (0x55AA)
it: Firma MBR OK (0x55AA)
pt: Assinatura MBR OK (0x55AA)
ru: Подпись MBR в порядке (0x55AA)

source: Warning: MBR signature incorrect: {sig}
es: Advertencia: Firma MBR incorrecta: {sig}
it: Avviso: Firma MBR non corretta: {sig}
pt: Aviso: Assinatura MBR incorreta: {sig}
ru: Предупреждение: Неправильная подпись MBR: {sig}

source: GRUB signature found in MBR
es: Firma GRUB encontrada en MBR
it: Firma GRUB trovata nel MBR
pt: Assinatura GRUB encontrada no MBR
ru: Подпись GRUB найдена в MBR

source: Warning: GRUB signature not found in MBR
es: Advertencia: Firma GRUB no encontrada en MBR
it: Avviso: Firma GRUB non trovata nel MBR
pt: Aviso: Assinatura GRUB não encontrada no MBR
ru: Предупреждение: Подпись GRUB не найдена в MBR

source: GRUB signature found in partition boot sector
es: Firma GRUB encontrada en el sector de arranque de la partición
it: Firma GRUB trovata nel settore di boot della partizione
pt: Assinatura GRUB encontrada no setor de boot da partição
ru: Подпись GRUB найдена в загрузочном секторе раздела

source: Warning: GRUB signature not found in partition boot sector
es: Advertencia: Firma GRUB no encontrada en el sector de arranque de la partición
it: Avviso: Firma GRUB non trovata nel settore di boot della partizione
pt: Aviso: Assinatura GRUB não encontrada no setor de boot da partição
ru: Предупреждение: Подпись GRUB не найдена в загрузочном секторе раздела

source: Warning: Failed to verify GRUB installation: {error}
es: Advertencia: Fallo al verificar la instalación de GRUB: {error}
it: Avviso: Fallita verifica installazione GRUB: {error}
pt: Aviso: Falhou ao verificar instalação do GRUB: {error}
ru: Предупреждение: Не удалось проверить установку GRUB: {error}

source: Wrote MBR to {device}.
es: MBR escrito en {device}.
it: MBR scritto su {device}.
pt: MBR gravado em {device}.
ru: Записан MBR на {device}.

source: Error: Could not extract partition number from {primary}
es: Error: No se pudo extraer el número de partición de {primary}
it: Errore: impossibile estrarre il numero della partizione da {primary}
pt: Erro: Não foi possível extrair o número da partição de {primary}
ru: Ошибка: не удалось определить номер раздела из {primary}

source: Set partition active: {primary}
es: Partición marcada como activa: {primary}.
it: Partizione impostata come attiva: {primary}.
pt: Partição definida como ativa: {primary}
ru: Раздел отмечен как активный: {primary}.

source: Error: sfdisk returned exit code {code}
es: Error: sfdisk devolvió el código de salida {code}
it: Errore: sfdisk ha restituito il codice di uscita {code}
pt: Erro: sfdisk retornou código de saída {code}
ru: Ошибка: sfdisk завершился с кодом возврата {code}

source: Error: sfdisk command timed out
es: Error: el comando sfdisk excedió el tiempo de espera
it: Errore: il comando sfdisk è scaduto
pt: Erro: comando sfdisk excedeu o tempo limite
ru: Ошибка: команда sfdisk превысила время ожидания

source: Error: sfdisk not found - install util-linux package
es: Error: sfdisk no encontrado - instale el paquete util-linux
it: Errore: sfdisk non trovato - installa il pacchetto util-linux
pt: Erro: sfdisk não encontrado - instale o pacote util-linux
ru: Ошибка: sfdisk не найден — установите пакет util-linux

source: Error running sfdisk: {error}
es: Error al ejecutar sfdisk: {error}
it: Errore durante l'esecuzione di sfdisk: {error}
pt: Erro ao executar sfdisk: {error}
ru: Ошибка при выполнении sfdisk: {error}

source: Destination
es: Destino
it: Destinazione
pt: Destino
ru: Путь назначения

source: is already mounted.
es: ya está montado.
it: è già montato.
pt: já está montado.
ru: уже смонтирован.

source: Could not determine filesystem type of
es: No se pudo determinar el tipo de sistema de archivos de
it: Impossibile determinare il tipo di filesystem di
pt: Não foi possível determinar o tipo de sistema de arquivos de
ru: Не удалось определить тип файловой системы для

source: Failed to mount
es: No se pudo montar
it: Impossibile montare
pt: Falha ao montar
ru: Не удалось смонтировать

source: USB Device
es: Dispositivo USB
it: Dispositivo USB
pt: Dispositivo USB
ru: USB-устройство

source: SATA Drive
es: Disco SATA
it: Disco SATA
pt: Disco SATA
ru: SATA-накопитель

source: IDE Drive
es: Disco IDE
it: Disco IDE
pt: Disco IDE
ru: IDE-накопитель

source: MMC/SD Card
es: Tarjeta MMC/SD
it: Scheda MMC/SD
pt: Cartão MMC/SD
ru: MMC/SD-карта

source: Hard Disk Drive
es: Disco duro
it: Disco rigido
pt: Disco Rígido
ru: Жесткий диск

source: Warning: This appears to be a system disk
es: Advertencia: este parece ser un disco del sistema
it: Attenzione: questo sembra essere un disco di sistema
pt: Atenção: este parece ser um disco do sistema
ru: Предупреждение: это, похоже, системный диск

source: Warning: This disk has mounted partitions
es: Advertencia: este disco tiene particiones montadas
it: Attenzione: questo disco ha partizioni montate
pt: Atenção: este disco tem partições montadas
ru: Предупреждение: на этом диске есть смонтированные разделы

source: Please select a target disk and filesystem:
es: Por favor, seleccione un disco de destino y sistema de archivos:
it: Seleziona un disco di destinazione e un filesystem:
pt: Por favor, selecione um disco de destino e sistema de arquivos:
ru: Пожалуйста, выберите целевой диск и файловую систему:

source: Select Target Disk:
es: Seleccione el disco de destino:
it: Seleziona disco di destinazione:
pt: Selecione o disco de destino:
ru: Выберите целевой диск:

source: Select Filesystem Type:
es: Seleccione el tipo de sistema de archivos:
it: Seleziona tipo di filesystem:
pt: Selecione o tipo de sistema de arquivos:
ru: Выберите тип файловой системы:

source: <b>ext4</b> (best choice) + Stable and has journaling. + Fast performance with large-file support. - Not compatible with Windows, Mac and most hardware devices. <b>ext2</b> + Minimal write overhead preserves flash lifespan. + Simple structure is easy to recover. - No journaling increases risk of data loss if unplugged. - Not compatible with Windows, Mac and most hardware devices. <b>btrfs</b> + Snapshots enable easy rollback. + Built-in compression saves space. - Complex configuration may be needed. - Additional metadata can slow transfers on USB drives. - Not compatible with Windows, Mac and most hardware devices. <b>FAT32</b> + Universally readable by Windows, macOS, and Linux. + No extra drivers or setup needed. - 4 GiB file size limit. - No journaling increases risk of data loss if unplugged. - FUSE-based persistence reduce performance. <b>NTFS</b> + Supports large files and has journaling. + Native Windows support; fast read/write in Linux via ntfs3. - Not compatible with Mac and most hardware devices. - FUSE-based persistence reduce performance.
es: <b>ext4</b> (mejor opción) + Estable y con journaling. + Alto rendimiento con soporte para archivos grandes. - No compatible con Windows, Mac y la mayoría de dispositivos de hardware. <b>ext2</b> + Mínima escritura, preserva la vida útil de la memoria flash. + Estructura simple, fácil de recuperar. - Sin journaling, mayor riesgo de pérdida de datos si se desconecta. - No compatible con Windows, Mac y la mayoría de dispositivos de hardware. <b>btrfs</b> + Las instantáneas permiten fácil retroceso. + Compresión integrada ahorra espacio. - Puede requerir configuración compleja. - Metadatos adicionales pueden ralentizar transferencias en USB. - No compatible con Windows, Mac y la mayoría de dispositivos de hardware. <b>FAT32</b> + Universalmente legible por Windows, macOS y Linux. + No requiere controladores ni configuración adicional. - Límite de tamaño de archivo de 4 GiB. - Sin journaling, mayor riesgo de pérdida de datos si se desconecta. - La persistencia basada en FUSE reduce el rendimiento. <b>NTFS</b> + Soporta archivos grandes y tiene journaling. + Soporte nativo en Windows; lectura/escritura rápida en Linux vía ntfs3. - No compatible con Mac y la mayoría de dispositivos de hardware. - La persistencia basada en FUSE reduce el rendimiento.
it: <b>ext4</b> (scelta migliore) + Stabile e con journaling. + Alte prestazioni con supporto per file di grandi dimensioni. - Non compatibile con Windows, Mac e la maggior parte dei dispositivi hardware. <b>ext2</b> + Scritture minime, preserva la durata della memoria flash. + Struttura semplice, facile da recuperare. - Nessun journaling, maggiore rischio di perdita dati se scollegato. - Non compatibile con Windows, Mac e la maggior parte dei dispositivi hardware. <b>btrfs</b> + Gli snapshot permettono un facile rollback. + Compressione integrata per risparmiare spazio. - Potrebbe essere necessaria una configurazione complessa. - Metadati aggiuntivi possono rallentare i trasferimenti su USB. - Non compatibile con Windows, Mac e la maggior parte dei dispositivi hardware. <b>FAT32</b> + Universalmente leggibile da Windows, macOS e Linux. + Nessun driver o configurazione extra necessari. - Limite di dimensione file di 4 GiB. - Nessun journaling, maggiore rischio di perdita dati se scollegato. - La persistenza basata su FUSE riduce le prestazioni. <b>NTFS</b> + Supporta file di grandi dimensioni e ha journaling. + Supporto nativo Windows; lettura/scrittura veloce in Linux tramite ntfs3. - Non compatibile con Mac e la maggior parte dei dispositivi hardware. - La persistenza basata su FUSE riduce le prestazioni.
pt: <b>ext4</b> (melhor escolha) + Estável e possui journaling. + Alto desempenho com suporte a arquivos grandes. - Não compatível com Windows, Mac e a maioria dos dispositivos de hardware. <b>ext2</b> + Escrita mínima preserva a vida útil do flash. + Estrutura simples, fácil de recuperar. - Sem journaling, aumenta o risco de perda de dados se desconectado. - Não compatível com Windows, Mac e a maioria dos dispositivos de hardware. <b>btrfs</b> + Snapshots permitem fácil reversão. + Compressão embutida economiza espaço. - Pode exigir configuração complexa. - Metadados adicionais podem deixar transferências em USB mais lentas. - Não compatível com Windows, Mac e a maioria dos dispositivos de hardware. <b>FAT32</b> + Lido universalmente por Windows, macOS e Linux. + Não requer drivers ou configuração extra. - Limite de tamanho de arquivo de 4 GiB. - Sem journaling, aumenta o risco de perda de dados se desconectado. - Persistência baseada em FUSE reduz o desempenho. <b>NTFS</b> + Suporta arquivos grandes e possui journaling. + Suporte nativo no Windows; leitura/gravação rápida no Linux via ntfs3. - Não compatível com Mac e a maioria dos dispositivos de hardware. - Persistência baseada em FUSE reduz o desempenho.
ru: <b>ext4</b> (лучший выбор) + Стабильная и поддерживает журналирование. + Высокая производительность и поддержка больших файлов. - Не совместима с Windows, Mac и большинством устройств. <b>ext2</b> + Минимальная нагрузка на запись, продлевает срок службы флеш-памяти. + Простая структура, легко восстановить. - Нет журналирования, повышен риск потери данных при отключении. - Не совместима с Windows, Mac и большинством устройств. <b>btrfs</b> + Снимки позволяют легко откатываться к предыдущему состоянию. + Встроенное сжатие экономит место. - Может потребоваться сложная настройка. - Дополнительные метаданные могут замедлять работу на USB-накопителях. - Не совместима с Windows, Mac и большинством устройств. <b>FAT32</b> + Универсально читается Windows, macOS и Linux. + Не требует дополнительных драйверов или настроек. - Ограничение размера файла 4 ГиБ. - Нет журналирования, повышен риск потери данных при отключении. - Производительность с постоянством на базе FUSE снижена. <b>NTFS</b> + Поддерживает большие файлы и журналирование. + Родная поддержка в Windows; быстрая работа в Linux через ntfs3. - Не совместима с Mac и большинством устройств. - Производительность с постоянством на базе FUSE снижена.

source: GRUB Boot Menu Language:
es: Idioma del Menú de Arranque GRUB:
it: Lingua Menu di Avvio GRUB:
pt: Idioma do Menu de Inicialização GRUB:
ru: Язык загрузочного меню GRUB:

source: Multilingual menu
es: Menú multiidioma
it: Menu multilingue
pt: Menu multilíngue
ru: Многоязычное меню

source: Install
es: Instalar
it: Installa
pt: Instalar
ru: Установить

source: Configure MiniOS before installation
es: Configurar MiniOS antes de la instalación
it: Configura MiniOS prima dell'installazione
pt: Configurar o MiniOS antes da instalação
ru: Настроить MiniOS перед установкой

source: BIOS Bootloader:
es: Gestor de arranque BIOS:
ru: Загрузчик BIOS:
