Repository: minios-linux/minios-installer
Catalog: locale/*.po
Languages: es, fr, it, pt_br

source: Error
fr: Erreur
it: Errore
pt_br: Erro

source: This script should be run as "root"!
es: ¡Este script debe ejecutarse como "root"!
fr: Ce script doit être exécuté en tant que "root" !
it: Questo script deve essere eseguito come "root"!
pt_br: Este script deve ser executado como "root"!

source: Failed to set GPT label on
es: Error al establecer la etiqueta GPT en
fr: Échec de la définition de l'étiquette GPT sur
it: Impossibile impostare l'etichetta GPT su
pt_br: Falha ao definir a etiqueta GPT em

source: Failed to create primary partition on
es: Error al crear la partición primaria en
fr: Échec de la création de la partition primaire sur
it: Impossibile creare la partizione primaria su
pt_br: Falha ao criar a partição primária em

source: Failed to create ESP partition on
es: Error al crear la partición ESP en
fr: Échec de la création de la partition ESP sur
it: Impossibile creare la partizione ESP su
pt_br: Falha ao criar a partição ESP em

source: Failed to set boot flag on ESP partition of
es: Error al establecer la bandera de arranque en la partición ESP de
fr: Échec de la définition de l'indicateur de démarrage sur la partition ESP de
it: Impossibile impostare il flag di avvio sulla partizione ESP di
pt_br: Falha ao definir o sinalizador de inicialização na partição ESP de

source: Failed to set MSDOS label on
es: Error al establecer la etiqueta MSDOS en
fr: Échec de la définition de l'étiquette MSDOS sur
it: Impossibile impostare l'etichetta MSDOS su
pt_br: Falha ao definir a etiqueta MSDOS em

source: Failed to create second primary partition on
es: Error al crear la segunda partición primaria en
fr: Échec de la création de la deuxième partition primaire sur
it: Impossibile creare la seconda partizione primaria su
pt_br: Falha ao criar a segunda partição primária em

source: Failed to set boot flag on primary partition of
es: Error al establecer la bandera de arranque en la partición primaria de
fr: Échec de la définition de l'indicateur de démarrage sur la partition primaire de
it: Impossibile impostare il flag di avvio sulla partizione primaria di
pt_br: Falha ao definir o sinalizador de inicialização na partição primária de

source: as
es: como
fr: en
it: come
pt_br: como

source: as fat32
es: como fat32
fr: en fat32
it: come fat32
pt_br: como fat32

source: Warning
es: Advertencia
fr: Avertissement
it: Avvertimento
pt_br: Aviso

source: Directory
es: Directorio
fr: Répertoire
pt_br: Diretório

source: is not empty. Do you want to delete it?
es: no está vacío. ¿Desea eliminarlo?
fr: n'est pas vide. Voulez-vous le supprimer ?
it: non è vuoto. Vuoi eliminarlo?
pt_br: não está vazio. Deseja excluí-lo?

source: Yes
es: Sí
fr: Oui
it: Sì
pt_br: Sim

source: No
fr: Non
pt_br: Não

source: Failed to clear directory
es: Error al limpiar el directorio
fr: Échec du nettoyage du répertoire
it: Impossibile svuotare la directory
pt_br: Falha ao limpar o diretório

source: Failed to create directory
es: Error al crear el directorio
fr: Échec de la création du répertoire
it: Impossibile creare la directory
pt_br: Falha ao criar o diretório

source: Destination
es: Destino
it: Destinazione
pt_br: Destino

source: is already mounted
es: ya está montado
fr: est déjà monté
it: è già montato
pt_br: já está montado

source: Could not determine filesystem type of
es: No se pudo determinar el tipo de sistema de archivos de
fr: Impossible de déterminer le type de système de fichiers de
it: Impossibile determinare il tipo di file system di
pt_br: Não foi possível determinar o tipo de sistema de arquivos de

source: Failed to mount
es: Error al montar
fr: Échec du montage
it: Montaggio fallito
pt_br: Falha ao montar

source: to
es: a
fr: à
it: a
pt_br: para

source: with type
es: con el tipo
fr: avec le type
it: con tipo
pt_br: com o tipo

source: EFI destination
es: Destino EFI
fr: Destination EFI
it: Destinazione EFI
pt_br: Destino EFI

source: Failed to unmount
es: Error al desmontar
fr: Échec du démontage
it: Smontaggio fallito
pt_br: Falha ao desmontar

source: Cannot find boot/vmlinuz in MiniOS data.
es: No se puede encontrar boot/vmlinuz en los datos de MiniOS.
fr: Impossible de trouver boot/vmlinuz dans les données de MiniOS.
it: Impossibile trovare boot/vmlinuz nei dati MiniOS.
pt_br: Não foi possível encontrar boot/vmlinuz nos dados do MiniOS.

source: Failed to change directory to
es: Error al cambiar el directorio a
fr: Échec du changement de répertoire vers
it: Impossibile cambiare directory in
pt_br: Falha ao mudar para o diretório

source: Failed to create MiniOS directories
es: Error al crear los directorios de MiniOS
fr: Échec de la création des répertoires MiniOS
it: Impossibile creare le directory MiniOS
pt_br: Falha ao criar os diretórios do MiniOS

source: Failed to create EFI directory
es: Error al crear el directorio EFI
fr: Échec de la création du répertoire EFI
it: Impossibile creare la directory EFI
pt_br: Falha ao criar o diretório EFI

source: Failed to copy EFI file
es: Error al copiar el archivo EFI
fr: Échec de la copie du fichier EFI
it: Impossibile copiare il file EFI
pt_br: Falha ao copiar o arquivo EFI

source: Error installing boot loader.
es: Error al instalar el cargador de arranque.
fr: Erreur lors de l'installation du chargeur de démarrage.
it: Errore durante l'installazione del boot loader.
pt_br: Erro ao instalar o gerenciador de inicialização.

source: Failed to write MBR to
es: Error al escribir el MBR en
fr: Échec de l'écriture du MBR sur
it: Impossibile scrivere l'MBR su
pt_br: Falha ao gravar o MBR em

source: Failed to set active partition on
es: Error al establecer la partición activa en
fr: Échec de la définition de la partition active sur
it: Impossibile impostare la partizione attiva su
pt_br: Falha ao definir a partição ativa em

source: WARNING!
es: ¡ADVERTENCIA!
fr: AVERTISSEMENT !
it: ATTENZIONE!
pt_br: ATENÇÃO!

source: Cannot install on the same disk from which the system is running.
es: No se puede instalar en el mismo disco desde el que se está ejecutando el sistema.
fr: Impossible d'installer sur le même disque à partir duquel le système est en cours d'exécution.
it: Impossibile installare sullo stesso disco da cui è in esecuzione il sistema.
pt_br: Não é possível instalar no mesmo disco em que o sistema está sendo executado.

source: Return
es: Regresar
fr: Retour
it: Ritorno
pt_br: Voltar

source: All data on the selected device will be lost!
es: ¡Se perderán todos los datos del dispositivo seleccionado!
fr: Toutes les données sur le périphérique sélectionné seront perdues !
it: Tutti i dati sul dispositivo selezionato verranno persi!
pt_br: Todos os dados no dispositivo selecionado serão perdidos!

source: Selected device:
es: Dispositivo seleccionado:
fr: Périphérique sélectionné :
it: Dispositivo selezionato:
pt_br: Dispositivo selecionado:

source: Continue
es: Continuar
fr: Continuer
it: Continua
pt_br: Continuar

source: MiniOS Installer
es: Instalador de MiniOS
fr: Installateur MiniOS
pt_br: Instalador do MiniOS

source: Installing...
es: Instalando...
fr: En cours d'installation...
it: In installazione...
pt_br: Instalando...

source: An error occurred during the installation of MiniOS on disk.
es: Ocurrió un error durante la instalación de MiniOS en el disco.
fr: Une erreur s'est produite lors de l'installation de MiniOS sur le disque.
it: Si è verificato un errore durante l'installazione di MiniOS sul disco.
pt_br: Ocorreu um erro durante a instalação do MiniOS no disco.

source: Unmounting disk
es: Desmontando disco
fr: Démontage du disque
it: Smontaggio del disco
pt_br: Desmontando o disco

source: Erasing disk
es: Borrando disco
fr: Effacement du disque
it: Cancellazione del disco
pt_br: Apagando o disco

source: Partitioning disk
es: Particionando disco
fr: Partitionnement du disque
it: Partizionamento del disco
pt_br: Particionando o disco

source: Formatting partition
es: Formateando partición
fr: Formatage de la partition
it: Formattazione della partizione
pt_br: Formatando a partição

source: Mounting partition
es: Montando partición
fr: Montage de la partition
it: Montaggio della partizione
pt_br: Montando a partição

source: Copying files
es: Copiando archivos
fr: Copie des fichiers
it: Copia dei file
pt_br: Copiando arquivos

source: Setting up bootloader
es: Configurando el cargador de arranque
fr: Configuration du chargeur de démarrage
it: Impostazione del bootloader
pt_br: Configurando o gerenciador de inicialização

source: No available devices found.
es: No se encontraron dispositivos disponibles.
fr: Aucun périphérique disponible trouvé.
it: Nessun dispositivo disponibile trovato.
pt_br: Nenhum dispositivo disponível encontrado.

source: Select installation options for MiniOS:
es: Seleccione las opciones de instalación para MiniOS:
fr: Sélectionnez les options d'installation pour MiniOS :
it: Seleziona le opzioni di installazione per MiniOS:
pt_br: Selecione as opções de instalação para o MiniOS:

source: Select device
es: Seleccionar dispositivo
fr: Sélectionnez le périphérique
it: Seleziona dispositivo
pt_br: Selecionar dispositivo

source: Select file system
es: Seleccionar sistema de archivos
fr: Sélectionnez le système de fichiers
it: Seleziona sistema di file
pt_br: Selecionar sistema de arquivos

source: Cancel
es: Cancelar
fr: Annuler
it: Annulla
pt_br: Cancelar

source: Install
es: Instalar
fr: Installer
it: Installa
pt_br: Instalar

source: Reload
es: Recargar
fr: Recharger
it: Ricarica
pt_br: Recarregar

source: No device selected.
es: No se ha seleccionado ningún dispositivo.
fr: Aucun périphérique sélectionné.
it: Nessun dispositivo selezionato.
pt_br: Nenhum dispositivo selecionado.

source: Enable EFI support?
es: ¿Activar soporte EFI?
fr: Activer le support EFI ?
it: Abilitare il supporto EFI?
pt_br: Ativar suporte a EFI?

source: Installation complete. Please restart your computer to apply the changes.
es: Instalación completa. Reinicie su computadora para aplicar los cambios.
fr: Installation terminée. Veuillez redémarrer votre ordinateur pour appliquer les modifications.
it: Installazione completata. Riavvia il computer per applicare le modifiche.
pt_br: Instalação concluída. Reinicie o computador para aplicar as alterações.

source: Finish
es: Finalizar
fr: Terminer
it: Fine
pt_br: Concluir
